# encoding:utf-8

# # 1.用for循环打印列表中的每个元素
# list=["周一","周二","周三","周四","周五","周六","周日"]
# for a in list:
#     print (a)
#
# # 2.规定起始位，终止位，步长来进行遍历
# for b in range(0,10,2):
#     # 1是起始的值，10是终止的值，2是每次运算所进行的值，即从0开始，进行2位到2，输出2继续进行，直至进行到10
#     if b ==0:
#         pass# pass跳过，即从0开始，0是第一位，跳过则不输出0这个结果
#     else:
#         print b


# 3.生成规定起始位，终止位，步长值的列表
# print (range(0,10,2))

# 4.获取用户输入，直到用户输入的是一个数值
while True:
    try:
        c= input ("请输入利润（单位万元）")
        break
    except:
        print ('请输入正确的数字')
print c

